```digitalocean_firewall.main: Refreshing state... [id=83dc9b06-d529-4fba-9b20-9c425fd474cd]
aws_s3_bucket.tf-backend: Refreshing state... [id=tf-backend-abhishek]
data.aws_ami.debian_x86: Reading...
aws_dynamodb_table.tf-state-lock: Refreshing state... [id=tf-state-lock]
aws_s3_bucket.tf-management-trail: Refreshing state... [id=tf-management-trail]
aws_kms_key.encryption_key: Refreshing state... [id=ccd23c99-9272-49bb-a20e-04b223695683]
data.aws_ami.debian_arm64: Reading...
aws_iam_role.dev_instance_role: Refreshing state... [id=dev_instance_role]
aws_security_group.main: Refreshing state... [id=sg-06aba332b2d3d09ea]
data.aws_ami.debian_x86: Read complete after 1s [id=ami-02c084bff28b29ca4]
data.aws_ami.debian_arm64: Read complete after 1s [id=ami-07271e17fea6ec431]
aws_iam_role_policy_attachment.secrets_manager_policy_attachment: Refreshing state... [id=dev_instance_role-20210925181828900900000002]
aws_iam_role_policy_attachment.s3_policy_attachment: Refreshing state... [id=dev_instance_role-20210925181828891000000001]
aws_iam_instance_profile.dev_instance_profile: Refreshing state... [id=instance_profile]
aws_s3_bucket_policy.tf-backend-policy: Refreshing state... [id=tf-backend-abhishek]
aws_s3_bucket_public_access_block.tf-backend-public-access-block: Refreshing state... [id=tf-backend-abhishek]
aws_s3_bucket_logging.tf-backend-logging: Refreshing state... [id=tf-management-trail]
aws_s3_bucket_policy.tf-management-trail-policy: Refreshing state... [id=tf-management-trail]
aws_cloudtrail.management[0]: Refreshing state... [id=tf-trail-management]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.tf-management-trail will be updated in-place
  ~ resource "aws_s3_bucket" "tf-management-trail" {
        id                          = "tf-management-trail"
        tags                        = {}
        # (11 unchanged attributes hidden)

      - logging {
          - target_bucket = "tf-backend-abhishek" -> null
          - target_prefix = "log/" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # aws_security_group.main must be replaced
-/+ resource "aws_security_group" "main" {
      ~ arn                    = "arn:aws:ec2:us-east-1:408911611184:security-group/sg-06aba332b2d3d09ea" -> (known after apply)
      ~ description            = "Default SG for instances" -> "Default Security Group for instances" # forces replacement
      ~ id                     = "sg-06aba332b2d3d09ea" -> (known after apply)
        name                   = "main"
      + name_prefix            = (known after apply)
      ~ owner_id               = "408911611184" -> (known after apply)
        tags                   = {
            "Name" = "main_sg"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: CURRENTPLAN.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "CURRENTPLAN.tfplan"
Releasing state lock. This may take a few moments...
```